esp-arduino-libs/esp-display-panel/test_apps/common/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
# CONFIG_IDF_TARGET="esp32p4"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_PANEL_CONF_FILE_SKIP=n
CONFIG_ESP_PANEL_BOARD_DEFAULT_USE_SUPPORTED=y
CONFIG_BOARD_ESP32_P4_FUNCTION_EV_BOARD=y
CONFIG_ESP_UTILS_CONF_FILE_SKIP=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
